-- phpMyAdmin SQL Dump
-- version 4.5.1
-- http://www.phpmyadmin.net
--
-- 主機: 127.0.0.1
-- 產生時間： 2016-04-25 03:28:10
-- 伺服器版本: 5.7.9
-- PHP 版本： 5.5.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `fun`
--

-- --------------------------------------------------------

--
-- 資料表結構 `course_name`
--

CREATE TABLE `course_name` (
  `course_id` varchar(255) NOT NULL,
  `category` varchar(255) NOT NULL,
  `course_name` varchar(255) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `course_name`
--

INSERT INTO `course_name` (`course_id`, `category`, `course_name`) VALUES
('DYUx/dyu10401/201511', 'course', '為公司把把脈'),
('FCU/2015S006/201509', 'course', '複利數學'),
('FCUx/2015001/201511', 'course', '創業九宮格'),
('ELFESS/A104_01/2014_12', 'course', '中小學數位閱讀計畫系列課程'),
('FCUx/2015002/201510', 'course', '併軌-發現社會企業'),
('EnergyEdu/MO0001/201506', 'course', 'K-12能源科技教育種子教師培訓(初階)'),
('FCUx/2015003/201511', 'course', '把智慧嵌入這個大千世界'),
('FCUx/2015004/201509', 'course', '大學普通物理實驗─手作坊'),
('FCUx/2015007/201510', 'course', '從車庫到金庫- 看見台灣企業生命力 (企業專班-薰衣草森林)'),
('EnergyEdu/MO0002/201512', 'course', 'K-12能源科技教育種子教師培訓(中階)'),
('FCU/2015S007/201509', 'course', '工程數學─傅立葉(Fourier)分析與偏微分方程式'),
('FCUx/2015S001/201509', 'course', '創新策略與領導(逢甲專班)'),
('FCUx/2015005/201509', 'course', '從車庫到金庫─看見台灣企業生命力(逢甲國貿專班)'),
('FCUx/2015008/201509', 'course', '從車庫到金庫─看見台灣企業生命力(企業專班-歐都納)'),
('NCU/CEA011/2015F', 'course', '機器學習'),
('FCUx/2015010/201512', 'course', '空間資訊與智慧生活'),
('NCU/CEA036/2015S', 'course', '電腦攻擊與防禦'),
('FCUx/2015S002/201509', 'course', '電子學(一)(逢甲專班)'),
('NCU/CEA039/2014F', 'course', 'Linux作業系統核心'),
('FCUx/2015011/201509', 'course', '從車庫到金庫─看見台灣企業生命力'),
('FCUx/mooc0003/201410', 'course', '空間資訊與智慧生活'),
('NCU/CEA048/2015S', 'course', '網際網路資料探勘 '),
('FCU/2015S003/201509', 'course', '微積分'),
('FCUx/mooc0004/201411', 'course', 'I Fun 好聲音─玩出屬於你的耳機'),
('FCU/2015S004/201510', 'course', '普通物理-電磁光'),
('FCUx/mooc0005/201412', 'course', '大學普通物理實驗─手作坊'),
('FCUx/2015012/201509', 'course', '從車庫到金庫─看見台灣企業生命力(逢甲EMBA專班)'),
('FCU/2015S005/201509', 'course', '工程數學'),
('IDRS/IDRS-Parent-01/201409', 'course', '家長線上課程'),
('FCUx/mooc0002/201410', 'course', '讓老闆不得不重用你~正在崛起的「專案管理」'),
('NCU/CE6002/2015S', 'course', '書報討論'),
('NCU/CEA005/2015F', 'course', '(停開) 高等演算法'),
('NCU/CEA020/2014F', 'course', '多媒體資訊系統'),
('NCU/CEA030/2015S', 'course', '語音訊號處理'),
('NCU/CEA037/2015S', 'course', '嵌入式系統設計'),
('NCU/CEA045/2014F', 'course', '計算幾何 '),
('NCU/CEA207/2014F', 'course', '影像處理'),
('NCU/MO0000/201501', 'course', 'NCUx體驗課程'),
('NCU/CE6001/2014F', 'course', '書報討論'),
('NCU/CEA014/2014F', 'course', '無線感測網路協定與應用'),
('NCU/CEA027/2015F', 'course', '影像處理'),
('FCUx/2015009/201509', 'course', '從車庫到金庫─看見台灣企業生命力(企業專班 ─ 味丹企業)'),
('NCUx/MO0000/201501', 'course', 'NCUx體驗課程'),
('NCU/CEA047/2015F', 'course', '貝氏資料分析介紹'),
('NCUx/MO0010/201507', 'course', '微積分拾級（一）'),
('NCU/MO0015/201509', 'course', '1041微積分聯合教學--地科班'),
('NCUx/MO0011/201509', 'course', '臺灣客家文化導論-臺灣的客家話與客家文學'),
('NCUx/MO0014/201512', 'course', '臺灣客家文化導論'),
('FCUx/2015014/201511', 'course', '從車庫到金庫─看見台灣企業生命力(台中榮民服務處)'),
('FCUx/2015016/201601', 'course', '把智慧嵌入這個大千世界'),
('FCUx/mooc0001/201410', 'course', '從車庫到金庫─看見台灣企業生命力'),
('NCUx/MO0002/201411', 'course', '微積分拾級（二）'),
('IDRS/IDRS-Expert-01/201409', 'course', '輔導專家線上課程'),
('KSUx/2015001/201601', 'course', '背包客日語'),
('NCU/CE1001/2015F', 'course', '計算機概論'),
('NCU/CE7047/2014F', 'course', '智慧型運輸系統專利研討專題'),
('NCU/CEA006/2015S', 'course', '虛擬實境'),
('NKUHTx/TC101/201511', 'course', '台灣傳統糕餅文化與製作、創新'),
('SP/103000105/104', 'course', '數值分析入門'),
('NCUx/MO0003/201503', 'course', '普通化學'),
('SP/103000405/104', 'course', '臺灣當代藝術與視覺文化鑑賞'),
('SP/103000703/104', 'course', '銀髮健康與科技微學程：銀髮心理與生活'),
('NCUx/MO0012/201510', 'course', '線性代數(一)'),
('NCUx/MO0001/201409', 'course', '演算法基礎與應用 (Algorithm Essentials and Applications)'),
('SEC/SE101/2015_Spring', 'course', '軟體設計'),
('NCUx/MO000301/201409', 'course', '普通化學'),
('SP/103000104/104', 'course', '微積分'),
('NCUx/MO0013/201510', 'course', '普通化學—原子結構與原子間的鍵結'),
('SP/103000403/104', 'course', '環境倫理與永續發展'),
('SP/103001304/104', 'course', '國際人權法律與實務'),
('SEC/SE102/2015_Fall', 'course', '軟體測試'),
('SP/103001501/104', 'course', '學習診斷與輔導'),
('SP/103001901/104', 'course', '全球化與多元文化'),
('SP/103000401/104', 'course', '華語文教學導論'),
('SP/103000404/104', 'course', '地球從誕生到演化'),
('SP/103000505/104', 'course', '從醫學看生死'),
('SP/103000603/104', 'course', '流行文化與國際關係'),
('SP/103000501/104', 'course', '初級生活華語'),
('SP/103000704/104', 'course', '電子與半導體微學程：半導體元件物理'),
('SP/103000705/104', 'course', '微積分微學程：微積分(一)'),
('NCUx/MO0004/201409', 'course', '商管微積分'),
('SP/103002205/104', 'course', '統計學'),
('SP/103000805/104', 'course', '微積分拾級（二）'),
('NCUx/MO0005/201502', 'course', '管院微積分(上)'),
('NCUx/MO0006/201503', 'course', '管院微積分(下)'),
('SP/103000901/104', 'course', '數位學習導論與實務'),
('NCUx/MO0007/201505', 'course', '學術英文'),
('SP/103000903/104', 'course', '環境科技與保護'),
('SP/103000904/104', 'course', '動力學'),
('SP/103001303/104', 'course', '易數邏輯'),
('SP/103003102/104', 'course', '生活中無所不在的物理'),
('SP/103001503/104', 'course', '諮商技巧'),
('SP/103014401/104', 'course', '走進臺灣戲曲大觀園'),
('SP/1030a0101/104', 'course', '初階行銷企劃與模擬經營'),
('SP/103002202/104', 'course', '“自媒體”傳播'),
('SP/103002203/104', 'course', '色彩照明影像科技概論'),
('SP/103002303/104', 'course', '場域活化設計'),
('SP/103002305/104', 'course', '當代應用心理學'),
('NIUx/NIU01/104', 'course', '生活中無所不在的物理'),
('SP/103002705/104', 'course', '防天災保平安-求生秘訣'),
('SP/103002504/104', 'course', '化學'),
('SP/103000103/104', 'course', '中華文化英語課程：中國戲劇'),
('SP/103002801/104', 'course', '華文戲劇概論'),
('SP/103000205/104', 'course', '生態體系與全球變遷'),
('SP/103002802/104', 'course', '動作分析'),
('SP/103002803/104', 'course', '曠世名琴訴說的故事'),
('SP/103100405/104', 'course', '科學與倫理'),
('SP/103100701/104', 'course', '從車庫到金庫 - 看見台灣企業生命力'),
('SP/103005204/104', 'course', '海洋資源與保育'),
('SP/1030a0104/104', 'course', '達爾文與人'),
('SP/103100203/104', 'course', '後現代?會電影：台?'),
('SP/1030a0103/104', 'course', '生活、科技與法律'),
('SP/103100401/104', 'course', '作業系統導論'),
('SP/103100803/104', 'course', '全球化/在地化莎士比亞'),
('SP/103100204/104', 'course', '銀髮族的身心靈發展'),
('SP/103100403/104', 'course', '音樂基礎訓練'),
('SP/103000802/104', 'course', '演算法基礎與應用 (Algorithm Essentials and Applications)'),
('SP/103100404/104', 'course', '創意思解'),
('SP/103101001/104', 'course', '電子學─放大器之原理與分析'),
('SP/103100501/104', 'course', '書法e動─文字的生命律動'),
('SP/103101202/104', 'course', '財務會計_基礎篇'),
('SP/103100702/104', 'course', '空間資訊與智慧生活'),
('SP/103101405/104', 'course', '數位平面媒體編輯'),
('SP/103100705/104', 'course', '大學普通物理實驗-手作坊'),
('SP/103100703/104', 'course', '讓老闆不得不重用你~正在崛起的「專案管理」'),
('SP/103100704/104', 'course', 'I Fun 好聲音─玩出屬於你的耳機'),
('SP/103100802/104', 'course', '西遊記'),
('SP/103103002/104', 'course', '生態旅遊與永續觀光'),
('SP/103101002/104', 'course', 'C#程式設計'),
('SP/103101003/104', 'course', '電腦輔助設計與製造'),
('SP/103101004/104', 'course', '實用科技英文'),
('SP/103101005/104', 'course', '國際化策略'),
('SP/103101204/104', 'course', '台灣文化旅遊'),
('SP/103103901/104', 'course', '東方宗教養生學(佛教篇)'),
('SP/103104803/104', 'course', '居家照顧實務'),
('SP/103105301/104', 'course', '走讀台灣茶'),
('SP/103105601/104', 'course', '茶與創意生活'),
('SP/103105602/104', 'course', '本聲綱目'),
('SP/103101901/104', 'course', '輕鬆學力學'),
('SP/103102303/104', 'course', '商業美學與文創藝術'),
('SP/103102001/104', 'course', '生命教育: 生命不設限'),
('SP/103103701/104', 'course', '海洋之窗—海洋博物?和它們?結的海洋世界'),
('SP/103102302/104', 'course', '盛唐飛仙─天才李白'),
('SP/103102801/104', 'course', '醫學資訊學'),
('SP/103106002/104', 'course', '生態旅遊'),
('SP/103102802/104', 'course', '中藥概論'),
('SP/103116402/104', 'course', '論語中的生活大師'),
('SP/103102805/104', 'course', '居家照顧與技巧'),
('edX/DemoX/Demo_Course', 'course', 'edX Demonstration Course'),
('TaiwanMOOC/103101202/2014', 'course', '財務會計_基礎篇'),
('SP/103103101/104', 'course', '安寧療護'),
('TaiwanMOOC/G201401/2014_09', 'course', '磨課師課程設計與錄製研討會 '),
('TaiwanMOOC/G201501/2015_01', 'course', '2015 磨課師課程經營國際研討會'),
('TaiwanMOOC/G201502/2015_02', 'course', '『你不可不知的磨課密技大公開』工作坊'),
('YunTechx/yuntech001/201511', 'course', '大學生的必修學分-情感教育'),
('SP/103001502/104', 'course', '諮商理論'),
('SP/103001903/104', 'course', '台灣歷史與文化'),
('SP/103001904/104', 'course', '華越雙語教學-A級'),
('SP/103002301/104', 'course', '化化世界－現代社會的化學'),
('SP/103002302/104', 'course', '2D動畫製作'),
('SP/103002505/104', 'course', '微積分預備課程'),
('SP/103004204/104', 'course', '小型風力機系統與國際認證'),
('SP/103004702/104', 'course', '巧克力製作'),
('SP/103004703/104', 'course', '廚藝色彩與造型理論'),
('SP/103100202/104', 'course', '古韻新妍——中國古典詩詞吟唱'),
('SP/103100503/104', 'course', '物聯網'),
('SP/103100505/104', 'course', '會計學原理');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
